<font size="6" face="verdana" color="green">
    <b>Introdução à Linguagem SQL</b><br>
    <b>DML:</b><i> <b>D</b>ata <b>M</b>anipulation <b>L</b>anguage</i><br>
    <u>Parte 4</u> &mdash; Subs-selects </font>
    </font>

<br><br>

**Objetivo:** Explorar comandos básicos da linguagem sub-linguagem de manipulaçào de dados em SQL,\
    usando como exemplo de teste uma <i>toy database</i> que contém dados sobre as mátriculas de 15 alunos:\
    &emsp; &emsp; __a base de Dados `Alunos15`__

__Atividades:__ 
 * Explorar o uso de Sub-selects para:
   * Gerar tabelas calculadas na cláusula `FROM`;
   * Comparar atributos com valores obtidos pela sub-consulta;
   * Comparar com outra tabela;
   * Operadores existenciais.

<br><br>

----

<br>

## 1. Conectar com a Base de Dados

Para começar, sempre é necessário, em cada `Notebook`:
  * Carregar os pacotes que serão usados;
  * Estabelecer a coneção com a base.

In [2]:
# Importar os módulos necessários para o Notebook:
import ipywidgets as widgets     #---
from sqlalchemy import create_engine

# Conectar com um servidor SQL na base Alunos 15 --> Postgres.Alunos15
%load_ext sql

# Connection format: %sql dialect+driver://username:password@host:port/database
engine = create_engine('postgresql://postgres:pgadmin@localhost/alunos15')
%sql postgresql://postgres:postgres@localhost/alunos15

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

<br><br>

----

<br>

## 2 Sub-selects na cláusula `FROM`

  * O resultado de um comando `SELECT` é sempre uma tabela,\
     portanto pode ser usado como uma tabela da cláusula `FROM`, tal como se fosse uma tabela-base.
  * Para isso, o subcomando `SELECT` deve ser colocado entre parênteses e sempre deve ter um `alias`.
  * Comandos `Sub-select` são úteis especialmente quando a sub-expressão contém operadores de agregação e/ou agrupamento.

Por exemplo:<br>
<i>Listar as notas em que o aluno 'Celso' foi aprovado</i>

In [3]:
%%sql
SELECT Aprov.CodigoTurma, Aprov.Nota
    FROM Aluno AS A JOIN (                  --   Subselect:
		SELECT *                            --<< Subselect
		    FROM Matricula                  --<< Subselect
            WHERE Nota>=5.0) AS Aprov       --<< Subselect
                       --- ^^^^^^^^^^ A tabela intermediária é chamada 'Aprov' neste comando!
	  ON A.NUSP=Aprov.NUSP
    WHERE A.Nome='Celso';

 * postgresql://postgres:***@localhost/alunos15
3 rows affected.

[(Decimal('100'), Decimal('9')),
 (Decimal('102'), Decimal('7')),
 (Decimal('104'), Decimal('7'))]

<br><br>

----

<br>

## 3 Sub-selects como valor de tupla

Quando o resultado de um sub-comando `SELECT` é uma tabela com exatamente uma tupla (ou nenhuma tupla), \
o valor dessa tupla pode ser usada para comparar as tuplas da tabela de consulta.
  * Se a tabela resultado do sub-comando `SELECT` tiver somente um atributo,
     o parêntese da sintaxe da tupla pode ser omitido, como sempre.

Por exemplo:\
<i>Listar as disciplinas em que o aluno `Celso` se matriculou e foi aprovado</i>:

In [4]:
%%sql
SELECT CodigoTurma
    FROM Matricula
        --- vvvvvv o valor constante de Matricula.NUSP é comparado com cada NUSP, de todos os Aluno.NUSP
    WHERE NUSP=(SELECT NUSP                   -- Subselect
                    FROM Aluno                -- Subselect
                    WHERE Nome='Celso')       -- Subselect
      AND Nota>=5;

 * postgresql://postgres:***@localhost/alunos15
3 rows affected.

[(Decimal('100'),), (Decimal('102'),), (Decimal('104'),)]

Outro exemplo:
<i>Listar as disciplinas em que o aluno `Celso` se matriculou no ano de `2023`:</i>

In [5]:
%%sql
SELECT Codigo, Sigla
FROM Matricula M JOIN Turma T
  ON M.CodigoTurma=T.Codigo
                            --- Veja que uma tupla constante é comparado com 
      --- vvvvvvvvvvvvvvvvvv... todas as tuplas correspondentes da relação Aluno
    WHERE (M.NUSP, T.Ano)=(
               SELECT NUSP, 2023 AS ANO 
                   FROM Aluno
                   WHERE Nome='Celso'
               );

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.

[(Decimal('101'), 'SMA-179')]

<br>

<b>Importante:</b>
  * Se o _sub-select_ retornar mais de uma tupla, ocorre um erro de execução.
  * Se não houver uma tupla no resultado, retorna relação nula (relação sem nenhuma tupla).

<br><br>

----

<br>

## 4 Sub-selects como expressões de tabelas

Quando usado em uma expressão de tabela, um sub-comando `SELECT` é aplicado para cada tupla da relação "externa".
  * A tupla passa para o resultado se o resultado dessa aplicação é `TRUE`.

<br>

Existem os seguintes operadores de expressão de tabelas:
  * <b><font size="3" face="courier" color="blue">
   EXISTS/NOT EXISTS $(<subconsulta>)$</font>
  * <b><font size="3" face="courier" color="blue">
    $(<tupla>)$ IN/NOT IN $(<subconsulta>)$</font>
  * <b><font size="3" face="courier" color="blue">
    $(<tupla>)\ \theta$ ANY/SOME $(<subconsulta>)$</font>
  * <b><font size="3" face="courier" color="blue">
    $(<tupla>)\ \theta$ ALL $(<subconsulta>)$</font>

Os atributos da tabela "externa" podem ser referenciados na sub-consulta, mas não vice-versa.

<div class=”square” style="background-color:#EAF030;"><font size="3" face="verdana" color="blue">
 Terminologia: <b>Consulta Correlacionada</b>
</font></div>
<div class=”square” style="background-color:#E0E0E0;"><font size="3" face="times" color="blue">
Quando os atributos da tabela "externa" são referenciados na sub-consulta, diz-se que a <u>sub-consulta é correlacionada</u>.
</div>

<br>

Por exemplo, a seguinte sub-consulta é correlacionada:\
<i>Listar os alunos matriculados</i>:

In [6]:
%%sql
SELECT Nome, NUSP
    FROM Aluno
    WHERE EXISTS(
              SELECT 'SIM' 
                  FROM Matricula
                  WHERE Aluno.NUSP = NUSP)
                  ---   ^^^^^^^^^^   Referência a um atributo externo

 * postgresql://postgres:***@localhost/alunos15
13 rows affected.

[('Carlos', Decimal('1234')),
 ('Celso', Decimal('2345')),
 ('Cicero', Decimal('3456')),
 ('Carlitos', Decimal('4567')),
 ('Catarina', Decimal('5678')),
 ('Cibele', Decimal('6789')),
 ('Corina', Decimal('7890')),
 ('Celina', Decimal('8901')),
 ('Celia', Decimal('9012')),
 ('Cesar', Decimal('9123')),
 ('Durval', Decimal('1479')),
 ('Dora', Decimal('1469')),
 ('Dina', Decimal('1459'))]

<br>

A seguinte sub-consulta é não-correlacionada:\
<i>Listar os alunos que tiraram mais do que 9,0 em ao menos uma disciplina</i>:

In [10]:
%%sql
SELECT Nome, NUSP
    FROM Aluno
    WHERE NUSP IN (
		     SELECT NUSP 
                 FROM Matricula
			     WHERE Nota>9.0)

 * postgresql://postgres:***@localhost/alunos15
3 rows affected.

[('Cicero', Decimal('3456')),
 ('Carlitos', Decimal('4567')),
 ('Corina', Decimal('7890'))]

<br><br>

----

<br>

### 4.1 Exemplo de `EXISTS/NOT EXISTS`

<i>Liste os alunos que fizeram alguma disciplina em 2023</i>:

In [11]:
%%sql
SELECT * 
    FROM Aluno A
    WHERE EXISTS (
        SELECT True                             -- Subselect
            FROM Matricula JOIN Turma           -- Subselect
	               ON CodigoTurma=Codigo        -- Subselect
                 JOIN Aluno                     -- Subselect
		           USING (NUSP)                 -- Subselect
            WHERE ANO=2023                      -- Subselect
              AND NUSP=A.NUSP                   -- Subselect
            )

 * postgresql://postgres:***@localhost/alunos15
8 rows affected.

[('Carlos', Decimal('1234'), Decimal('21'), 'Sao Carlos', 'Computação'),
 ('Celso', Decimal('2345'), Decimal('22'), 'Sao Carlos', 'Computação'),
 ('Cicero', Decimal('3456'), Decimal('22'), 'Araraquara', 'Matemática'),
 ('Carlitos', Decimal('4567'), Decimal('21'), 'Ibitinga', 'Computação'),
 ('Cibele', Decimal('6789'), Decimal('21'), 'Araraquara', 'Computação'),
 ('Corina', Decimal('7890'), Decimal('25'), 'Rio Claro', 'Matemática'),
 ('Celina', Decimal('8901'), Decimal('27'), 'Sao Carlos', 'Computação'),
 ('Celia', Decimal('9012'), Decimal('20'), 'Rio Claro', 'Computação')]

<br><br>

----

<br>

### 4.2 Exemplo de `IN/NOT IN`

<i>Listar os alunos aprovados em ao menos uma disciplina</i>:

In [12]:
%%sql
SELECT Nome, NUSP
    FROM Aluno
    WHERE NUSP IN (
		     SELECT NUSP 
                 FROM Matricula
			     WHERE Nota>5.0)

 * postgresql://postgres:***@localhost/alunos15
10 rows affected.

[('Carlos', Decimal('1234')),
 ('Celso', Decimal('2345')),
 ('Cicero', Decimal('3456')),
 ('Carlitos', Decimal('4567')),
 ('Catarina', Decimal('5678')),
 ('Cibele', Decimal('6789')),
 ('Corina', Decimal('7890')),
 ('Celina', Decimal('8901')),
 ('Celia', Decimal('9012')),
 ('Cesar', Decimal('9123'))]


<br><br>

----

<br>

### 4.3 Exemplo de &nbsp; $\theta$ ANY/SOME


<i>Listar os alunos mais velhos que algum professor</i>:

In [13]:
%sql    Result <<                      \
SELECT Nome, NUSP, Idade               \
	FROM Aluno                         \
	WHERE Idade > ANY(                 \
         SELECT Idade FROM Professor);

%sql Professor <<              \
SELECT Nome, Idade             \
    FROM Professor;

print('Resultado:\n', Result, sep='')
print('Idade dos professores (para comparar):\n', Professor, sep='')

 * postgresql://postgres:***@localhost/alunos15
2 rows affected.
Returning data to local variable Result
 * postgresql://postgres:***@localhost/alunos15
9 rows affected.
Returning data to local variable Professor
Resultado:
+--------+------+-------+
|  nome  | nusp | idade |
+--------+------+-------+
| Celina | 8901 |   27  |
| Denise | 4584 |   35  |
+--------+------+-------+
Idade dos professores (para comparar):
+---------+-------+
|   nome  | idade |
+---------+-------+
|   Ari   |   25  |
|   Adao  |   30  |
| Anselmo |   31  |
|  Amalia |   39  |
|   Ana   |   31  |
|  Alice  |   35  |
|  Amauri |   34  |
|  Artur  |   41  |
| Adriana |   45  |
+---------+-------+


<br><br>

----

<br>

### 4.4 Exemplo de &nbsp; $\theta$ ALL

<i>Listar os alunos mais velhos que todos os professores</i>:

In [14]:
%sql    Result <<                      \
SELECT Nome, NUSP, Idade               \
	FROM Aluno                         \
	WHERE Idade > ALL(                 \
         SELECT Idade FROM Professor);

 * postgresql://postgres:***@localhost/alunos15
0 rows affected.
Returning data to local variable Result

<br><br>

----

<br><br>
<font size="4">Conclusão</font>

  * Consultas sobre relações (sem tuplas repetidas) correlacionadas com os operadores `EXISTS` e `IN`\
    que não utilizem agregações e agrupamentos:\
    &emsp; &emsp; &emsp; <b><font color="teal">&starf; sempre podem ser traduzidas para expressões que não utilizam sub-consultas. &starf;</font></b>
  * Mas, se houverem tuplas repetidas, <font color="red">as sub-consultas podem não ser equivalentes!</font>\
    &emsp; &emsp; <font color="magenta" size="1"> como a teoria não adminte tuplas repetidas, isso não é levado em consideração!</font>
  * As sub-consultas podem não ir até o fim da iteração.
    * Por exemplo: com `IN/NOT IN`, o laço é encerrado \
      assim que é encontrada a primeira tupla que garante `TRUE/FALSE` na resposta.\
    <small>(cuidado com efeitos colaterais, especialmente quando:\
           &emsp; estiverem sendo feitas atualizações na base,\
           &emsp;  ou sendo usadas funções definidas pelo usuário.)</small>

<br><br>

----

<br><br>